config.org
#+title: my emacs config
#+author: Fat Belly
#+date: \today{}
#+email: optimalfatbelly@gmail.com
#+language: en
#+options: ':t toc:nil num:t author:t email:t
#+startup: content indent

Stolen from https://protesilaos.com/emacs/dotemacs

The basic idea is to use this =config.org= document to automatically
generate all the config files, including =early-init.el=, =init.el=,
as well as all the package configurations under the directory
=./module/=. Whenever this file is updated, I can evaluate the
following code block or do =C-c C-v C-t=, which will update all files
accordingly.

#+begin_src emacs-lisp :tangle no :results none
(org-babel-tangle)
#+end_src

* The early initialisation of Emacs (=early-init.el=)

This is the first file that Emacs reads when starting up. It should
contain code that does not depend on any package or the proportions of
the Emacs frame. In general, this early initialisation file is meant
to set up a few basic things before Emacs produces the initial frame
by delegating to the =init.el=

** The =early-init.el= initialises =straight.el= and =use-package.el=

#+begin_src emacs-lisp :tangle "early-init.el"
;; disable package.el
(setq package-enable-at-startup nil)
(setq straight-use-package-by-default t) ;; have use-package use straight.el by default.

;; straight.el init
;; source: https://github.com/radian-software/straight.el?tab=readme-ov-file#getting-started
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; install use-package via straight
(straight-use-package 'use-package) 
#+end_src

** The =early-init.el= gives a name to the default frame

#+begin_src emacs-lisp :tangle "early-init.el"
(add-hook 'after-init-hook (lambda () (set-frame-name "home")))
#+end_src

** Define all my paths in =early-init.el=

#+begin_src emacs-lisp :tangle "early-init.el"
(defvar my-module-path "~/.config/emacs/modules")
#+end_src

* The main initialisation of Emacs (=init.el=)

This is where I define the Lisp macros used in my setup and load all the invidiual modules.

#+begin_src emacs-lisp :tangle "init.el"
  (add-to-list 'load-path my-module-path)
  (require 'my-defaults)
  (require 'my-editor)
  (require 'my-ui)
  (require 'my-completion)
  (require 'my-org)
  (require 'my-latex)
  (require 'my-code)
  (require 'my-vc)
#+end_src

* The default configurations (=my-defaults.el=)

** configs using =use-package.el=

#+begin_src emacs-lisp :tangle "modules/my-defaults.el" :mkdirp yes
  (use-package emacs
    :init
    ;; sigh
    (defalias 'yes-or-no-p 'y-or-n-p)

    ; which directory to put backup files
    (setq backup-directory-alist `(("." . "~/.config/emacs/backups")))

    ;transform backups file name
    (setq auto-save-file-name-transforms '((".*" "~/.config/emacs/auto-save-list/" t)))

    ; toggle wrapping text at the 80th character
    (setq fill-column 80)
    (setq-default word-wrap t)

    ; turn off alarm
    (setq ring-bell-function 'ignore)

    ; disable scroll bar
    (scroll-bar-mode -1)

    ; do not display splash screen on startup
    (setq inhibit-splash-screen t)

    ; redisplay never recenters cursor
    (setq scroll-conservatively 101)

    ; spell checker
    (setq ispell-program-name "hunspell")

    ;; help window modifications
    (setq help-window-select t)
    (customize-set-variable
          'display-buffer-alist
          '(("\\*Help\\*" display-buffer-below-selected)))

    ;; relative line numbers
    (with-eval-after-load 'display-line-numbers
      (setq display-line-numbers-type 'relative
            display-line-numbers-width-start t))

    ;; tabs are evil
    (setq indent-tabs-mode nil)

    ;; always follow symlinks in git dirs
    (setq vc-follow-symlinks t)

    ;; whitespace
    (setq whitespace-style '(face trailing))

    ;; utf8 in every nook and cranny
    (set-charset-priority 'unicode)
    (setq locale-coding-system 'utf-8
          coding-system-for-read 'utf-8
          coding-system-for-write 'utf-8)
    (set-terminal-coding-system 'utf-8)
    (set-keyboard-coding-system 'utf-8)
    (set-selection-coding-system 'utf-8)
    (prefer-coding-system 'utf-8)
    (setq default-process-coding-system '(utf-8-unix . utf-8-unix))

    ;; persist a custom file
    (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
    (when (file-exists-p custom-file)
    (load custom-file))

    ; fix =defvar= warnings
    (setq enable-local-variables :all)

    ;; use trash-cli rather than rm when deleting files.
    (setq delete-by-moving-to-trash t)

    ;; less noise when compiling elisp
    (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
    (setq native-comp-async-report-warnings-errors nil)
    (setq load-prefer-newer t)

    ;; font!
    (add-to-list 'default-frame-alist '(font . "SF Mono-13"))

    ; default modes
    (global-hl-line-mode 1)
    (blink-cursor-mode 0)
    (recentf-mode 1)
    (show-paren-mode t)
    (flymake-mode -1)

    ;; set_this
    ;; (setq initial-scratch-message
    ;;       (concat
    ;;        (shell-command-to-string
    ;;         "fortune calvin| cowsay -f calvin") "emacs-init-time: " (emacs-init-time)))

    :delight
    (auto-fill-function " AF")
    (visual-line-mode))
#+end_src

** paths

#+begin_src emacs-lisp :tangle "modules/my-defaults.el" :mkdirp yes
  (setq my-config-dir "~/.config/emacs")
  (setq my-org-dir "~/Dropbox/org")
  (setq my-tex-local-path "~/Dropbox/50-scripts/texmf/tex/latex/local")
  (setq my-paper-dir "~/Dropbox/14-papers")
  (setq my-cite-csl-styles-dir (expand-file-name "~/Dropbox/55-software/Zotero/styles"))
  (setq my-org-roam-dir "~/Dropbox/13-notes/roam")

  (setq my-config-file (concat (file-name-as-directory my-config-dir) "config.org"))
  (setq my-init-file (concat (file-name-as-directory my-config-dir) "init.el"))
  (setq my-journal-dir (concat (file-name-as-directory my-org-dir) "journal"))
  (setq my-org-inbox (concat (file-name-as-directory my-org-dir) "inbox.org"))
  (setq my-org-gtd (concat (file-name-as-directory my-org-dir) "gtd.org"))
  (setq my-org-projects (concat (file-name-as-directory my-org-dir) "projects.org"))
  (setq my-org-reading (concat (file-name-as-directory my-org-dir) "readings.org"))
  (setq my-org-proposals (concat (file-name-as-directory my-org-dir) "proposals.org"))
  (setq my-org-teaching (concat (file-name-as-directory my-org-dir) "teaching.org"))
  (setq my-org-misc (concat (file-name-as-directory my-org-dir) "misc.org"))
  (setq my-org-archive (concat (file-name-as-directory my-org-dir) "archives/archives.org"))
  (setq my-org-roam-index (concat (file-name-as-directory my-org-roam-dir) "index.org"))

  (setq my-bib-files (concat (file-name-as-directory my-tex-local-path) "master.bib"))
  (setq my-pdf-library (concat (file-name-as-directory my-paper-dir) "pdfs"))
  (setq my-notes (concat (file-name-as-directory my-paper-dir) "notes"))
#+end_src

** diminisher

#+begin_src emacs-lisp :tangle "modules/my-defaults.el" :mkdirp yes
  (use-package diminish)
#+end_src

** my-defaults provider

#+begin_src emacs-lisp :tangle "modules/my-defaults.el" :mkdirp yes
  (provide 'my-defaults)
#+end_src

* The editor configurations (=my-editor.el=)

** evil configs 

#+begin_src emacs-lisp :tangle "modules/my-editor.el" :mkdirp yes
  (use-package which-key
    :diminish
    :config (which-key-mode 1))

  (use-package evil
    :init
    (setq evil-want-keybinding nil
          evil-respect-visual-line-mode t
  	evil-undo-system 'undo-fu
  	evil-mode-line-format nil)

    :custom
    (evil-want-C-u-scroll t) ;; allow scroll up with 'C-u'
    (evil-want-C-d-scroll t) ;; allow scroll down with 'C-d'
    :config
    (evil-mode 1))

  (use-package evil-collection
    :after evil
    :diminish
    ;; :ensure t
    ;; :custom
    ;; (evil-collection-setup-minibuffer t)
    :config
    (evil-collection-init))

  (use-package evil-easymotion
    :after evil
    :diminish)

  (use-package evil-surround
    :after evil
    :diminish
    :config (global-evil-surround-mode 1))

  (use-package evil-commentary
    :after evil
    :diminish
    :config
    (evil-commentary-mode) ;; globally enable evil-commentary
    )
#+end_src

** key bindings using =general.el=

*** best practices by the author of =general.el=

To facilitate extensibility and easy creation of wrappers, ~general-define-key~ uses keyword arguments to specify everything besides the key definitions, including for the =:states= and =:keymaps=. Since users will most often specify one or both of these keyword arguments, ~general-define-key~ is often less concise than ~define-key~ or ~evil-define-key~. It is for this reason that it is recommended that ~general-define-key~ not be used directly. =general.el= provides wrappers around ~general-define-key~ that take positional arguments like ~define-key~ and ~evil-define-key~ (~general-emacs-define-key~, ~general-evil-define-key~, and ~general-def~). It is recommended that you use these instead of ~general-define-key~. ~general-create-definer~ can also be used to create a new definer with certain default settings (e.g. prefix settings). For clarity and consistency, examples in the documentation usually use ~general-define-key~ unless the example is explicitly for a wrapper. However, [[#positional-argument-wrappers][~general-def~]] is recommended over ~general-define-key~ as it is more flexible and concise. Positional arguments are /optional but not required/, so ~general-def~ can mostly act as a drop-in replacement for many key definers (including ~general-define-key~, ~define-key~, and ~evil-define-key~). Note that ~general-create-definer~ and the =:general= keyword argument for ~use-package~ use ~general-def~. I personally only use ~general-def~.

Since it is more common for commands to not be sharp quoted in key definitions, this package's examples use single quotes for commands. I personally prefer to always properly sharp quote functions, so commands in the actual non-example code are always sharp quoted.

Although ~general-define-key~ will automatically defer keybindings until the specified keymaps exist, it is recommended you use it with ~with-eval-after-load~ or use-package's =:config= keyword instead. This is because while the deferring mechanism works, it is much slower than using ~eval-after-load~. See [[#will-generalel-slow-my-initialization-time][Will general.el slow my initialization time?]] for more information on ensuring you are not unnecessarily slowing down Emacs initialization.

See also the rest of [[#faq][FAQ]] for commonly asked questions

To summarize, my recommended usage of general.el looks like this:
- Use ~general-def~, other positional definers, and your own definers created with ~general-create-definer~
- Use =use-package= or a similar helper
- Use =:general= for keybindings meant to load a package
- Use =:general-config= or =:config= for other keybindings
- Do not use use the =:which-key= extended definition keyword unless you absolutely need to (see [[#which-key-integration][Which Key Integration]] for details)
- Follow the other recommendations in [[#will-generalel-slow-my-initialization-time][Will general.el slow my initialization time?]]

From a stylistic perspective (completely personal preference) I:
- Explicitly use the command name with =:general=, e.g. ~:general (general-def <keymap> ...)~ instead of ~:general (<keymap> ...)~. This allows individually evaling the forms or moving them elsewhere without having to change them.
- Sharp quote commands (e.g. ~#'execute-extended-command~) but not lambdas

