config.org
*** configs
#+begin_src emacs-lisp :tangle "modules/my-editor.el" :mkdirp yes
  (use-package general
    :after evil
    :config
    (setq general-override-states '(insert
                                    emacs
                                    hybrid
                                    normal
                                    visual
                                    motion
                                    operator
                                    replace))
    ;; (general-override-mode 1)

    ;; leader key SPC similar to spacemacs
    (general-create-definer leader
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC"
      :non-normal-prefix "C-SPC" ;; access leader in insert and mode
      )

    ;; local leader key SPC similar to spacemacs
    (general-create-definer local-leader
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC m"
      :non-normal-prefix "C-SPC m" ;; access local leader in insert mode
      )

    ;; some useful functions

    ;; open config directory
    (defun open-user-config-dir ()
      "Open the `user-config-dire' in the same window"
      (interactive)
      (dired my-config-dir))

    (defun find-user-config-file ()
      "Edit the `user-config-file', in same window."
      (interactive)
      (find-file my-config-file))

    (defun load-user-init-file ()
      "Load the `user-init-file', in same window."
      (interactive)
      (load-file my-init-file))

    (defun open-iTerm-here ()
      "Open item at the current path"
      (interactive)
      (shell-command "open -a iTerm ."))

    (defun open-Finder-here ()
      "Open Finder at the current path"
      (interactive)
      (shell-command "open ."))

    (defun my/open-inbox ()
      (interactive)
      "Open inbox directly"
      (find-file my-org-inbox))

    (defun my/open-gtd ()
      (interactive)
      "Open org-my-gtd directly"
      (find-file my-org-gtd))

    (defun my/open-roam-index ()
      (interactive)
      "Open my-org-roam-index directly"
      (find-file my-org-roam-index))

    (defun my/open-projects ()
      (interactive)
      "Open org-research directly"
      (find-file my-org-projects))

    (defun my/open-readings ()
      (interactive)
      "Open org-readings directly"
      (find-file my-org-reading))

    ;;Taken from http://emacsredux.com/blog/2013/05/04/rename-file-and-buffer/
    (defun rename-file-and-buffer ()
      "Rename the current buffer and file it is visiting."
      (interactive)
      (let ((filename (buffer-file-name)))
        (if (not (and filename (file-exists-p filename)))
            (message "Buffer is not visiting a file!")
          (let ((new-name (read-file-name "New name: " filename)))
            (cond
             ((vc-backend filename) (vc-rename-file filename new-name))
             (t
              (rename-file filename new-name t)
              (set-visited-file-name new-name t t)))))))

    ;; https://magnus.therning.org/2023-07-09-general.el-and-two-ways-to-define-keybindings.html
    (general-def
      "C-x x" 'eval-defun)

    (leader

      ""     nil
      "c"   (general-simulate-key "C-c")
      "h"   (general-simulate-key "C-h")
      "x"   (general-simulate-key "C-x")
      "u"   '(universal-argument :wk "C-u")

      ;; jumpers
      "j"   '(:ignore t :which-key "jump")
      "jl"  'evilem-motion-next-visual-line
      "jk"  'evilem-motion-previous-visual-line
      "jt"  'evilem-motion-find-char-to
      "jT"  'evilem-motion-find-char-to-backward
      "jf"  'evilem-motion-find-char
      "jF"  'evilem-motion-find-char-backward
      "j("  'evilem-motion-backward-sentence-begin
      "j)"  'evilem-motion-forward-sentence-begin

      ;; Theme operations
      "t"   '(:ignore t :which-key "themes")
      "tn"  'my/cycle-theme
      "tt"  'load-theme
      "tl"  'load-leuven-theme

      ;; Quit operations
      "q"	  '(:ignore t :which-key "quit emacs")
      "qq"  'kill-emacs
      ;; "qq"  'delete-frame

      ;; Buffer operations
      "b"   '(:ignore t :which-key "buffer")
      ;; "bb"  'mode-line-other-buffer
      "bk"  'kill-this-buffer
      "bn"  'next-buffer
      "bp"  'previous-buffer
      ;; "b]"  'next-buffer
      ;; "b["  'previous-buffer
      "bq"  'kill-buffer-and-window
      "bR"  'rename-file-and-buffer
      "br"  'revert-buffer
      "bb"  'switch-to-buffer
      "bi"  'ibuffer

      ;; Window operations
      "w"   '(:ignore t :which-key "window")
      "wn"  'evil-window-vnew
      "w>"  'evil-window-increase-width
      "w<"  'evil-window-decrease-width
      "w+"  'evil-window-increase-height
      "w-"  'evil-window-increase-height
      "w/"  'evil-window-vsplit
      "wv"  'evil-window-split
      "ww"  'evil-window-next
      "wc"  'evil-window-delete
      "wD"  'delete-other-windows

      ;; File operations
      "f"   '(:ignore t :which-key "files")
      "fc"  'write-file
      "fe"  '(:ignore t :which-key "emacs")
      "fed" 'open-user-config-dir
      "fec" 'find-user-config-file
      "feR" 'load-user-init-file
      "fd"  'dired
      "fb"  'bookmark-bmenu-list
      "fj"  'dired-jump
      "fl"  'find-file-literally
      "fR"  'rename-file-and-buffer
      "fs"  'save-buffer

      ;; Org mode

      "n"   '(:ignore t :which-key "notes")
      "ni"  'my/open-inbox
      "ng"  'my/open-gtd
      "np"  'my/open-projects
      "nr"  'my/open-readings
      "nn"  'my/open-roam-index

      ;; Applications
      ":"   'shell-command
      ";"   'eval-expression
      "a"   '(:ignore t :which-key "Applications")
      "ac"  'calendar
      "at"  'open-iTerm-here
      "af"  'open-Finder-here

      "wh"  'evil-window-left
      "wl"  'evil-window-right
      "wj"  'evil-window-down
      "wk"  'evil-window-up
      "bN"  'evil-buffer-new
      )
    )

#+end_src

** undo 

#+begin_src emacs-lisp :tangle "modules/my-editor.el" :mkdirp yes
  (use-package undo-fu
    :general
    ('normal "C-r" 'undo-fu-only-redo))
#+end_src

** smartparens

#+begin_src emacs-lisp :tangle "modules/my-editor.el" :mkdirp yes
  (use-package smartparens-mode
    :straight (:host github :repo "Fuco1/smartparens"
               :branch "master")
    :hook (prog-mode text-mode markdown-mode) ;; add `smartparens-mode` to these hooks
    :diminish
    :config
    ;; load default config
    (require 'smartparens-config))
#+end_src

** my-editor provider

#+begin_src emacs-lisp :tangle "modules/my-editor.el" :mkdirp yes
  (provide 'my-editor)
#+end_src

* The user interface configurations (=my-ui.el=)

** themes 

*** theme cycling 
#+begin_src emacs-lisp :tangle "modules/my-ui.el" :mkdirp yes
  (with-eval-after-load 'general
    (defun disable-all-themes ()
      "disable all active themes."
      (dolist (i custom-enabled-themes)
        (disable-theme i)))

    (defadvice load-theme (before disable-themes-first activate)
      (disable-all-themes))

    ;; Following lines to cycle through themes adapted from ivan's answer on
    ;; https://emacs.stackexchange.com/questions/24088/make-a-function-to-toggle-themes
    (setq my/themes (custom-available-themes))
    (setq my/themes-index 0)

    (defun my/cycle-theme ()
      "Cycles through my themes."
      (interactive)
      (setq my/themes-index (% (1+ my/themes-index) (length my/themes)))
      (my/load-indexed-theme))

    (defun my/load-indexed-theme ()
      (load-theme (nth my/themes-index my/themes)))

    (leader "t"   '(:ignore t :which-key "themes")
            "tn"  'my/cycle-theme
            "tt"  'load-theme)
  )
#+end_src

*** doom themes

#+begin_src emacs-lisp :tangle "modules/my-ui.el" :mkdirp yes
  (use-package doom-themes
    ;; :hook (after-init . load-doom-one-light)
    :config

    (defun load-doom-one-light ()
        "Load the `doom-one-light' theme."
        (interactive)
        (load-theme 'doom-one-light))

    (defun load-doom-solarized-dark ()
        "Load the `doom-solarized-dark' theme."
        (interactive)
        (load-theme 'doom-solarized-dark))

    (defun load-doom-solarized-light ()
        "Load the `doom-solarized-light' theme."
        (interactive)
        (load-theme 'doom-solarized-light))

    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled

    ;; Enable flashing mode-line on errors
    ;; (doom-themes-visual-bell-config)
    ;; Corrects (and improves) org-mode's native fontification.
    ;; (doom-themes-org-config)

    ;; (leader "tsl" 'load-doom-solarized-light
    ;;         "tsd" 'load-doom-solarized-dark)
  )
#+end_src

*** anti-zenburn

#+begin_src emacs-lisp :tangle "modules/my-ui.el" :mkdirp yes
  (use-package anti-zenburn-theme
    :config

    (defun load-anti-zenburn ()
        "Load the `doom-anti-zenburn' theme."
        (interactive)
        (load-theme 'anti-zenburn t))
    (leader "tsa" #'load-anti-zenburn))
#+end_src

*** leuven

#+begin_src emacs-lisp :tangle "modules/my-ui.el" :mkdirp yes
  (use-package leuven-theme
    :config
    (defun load-leuven-light ()
        "Load the `doom-leuven' theme."
        (interactive)
        (load-theme 'leuven t)))
#+end_src

*** default theme

#+begin_src emacs-lisp :tangle "modules/my-ui.el" :mkdirp yes
  (load-anti-zenburn)
#+end_src

** modeline

#+begin_src emacs-lisp :tangle "modules/my-ui.el" :mkdirp yes
  (use-package hide-mode-line
    :diminish
    :config
    (add-hook 'help-mode-hook #'hide-mode-line-mode))

  ;; modeline
  (use-package doom-modeline
    :init
    (doom-modeline-mode 1)
    :config
    (setq doom-modeline-height 25))
#+end_src

** soft-wrapper

#+begin_src emacs-lisp :tangle "modules/my-ui.el" :mkdirp yes
  (use-package olivetti
    :diminish
    :commands olivetti-mode
    :config
    (setq olivetti-body-width 120)
    (setq olivetti-minimum-body-width 120))
#+end_src

** my-ui provider

#+begin_src emacs-lisp :tangle "modules/my-ui.el" :mkdirp yes
  (provide 'my-ui)
#+end_src

* The completion configurations (=my-completion.el=)

#+begin_src emacs-lisp :tangle "modules/my-completion.el" :mkdirp yes
  (use-package vertico
    :init
    (setq vertico-cycle t)
    :config
    (vertico-mode)
    (leader
     "SPC" 'execute-extended-command
     ;; "bm"  'switch-to-buffer
     "ff"  'find-file))

  (use-package orderless
    :config
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion)))))

  (use-package savehist
    :straight (:type built-in)
    :config
    (savehist-mode))

  (use-package marginalia
    :after vertico
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :config
    (marginalia-mode))

  (use-package embark
    :general
    ("C-." 'embark-act)          ;; pick some comfortable binding
    :init
    (setq prefix-help-command #'embark-prefix-help-command)
    :config
    ;; stolen from https://github.com/patrl/emacs.d
    (defun embark-which-key-indicator ()
      "An embark indicator that displays keymaps using which-key.
    The which-key help message will show the type and value of the
    current target followed by an ellipsis if there are further
    targets."
      (lambda (&optional keymap targets prefix)
        (if (null keymap)
            (which-key--hide-popup-ignore-command)
          (which-key--show-keymap
           (if (eq (plist-get (car targets) :type) 'embark-become)
               "Become"
             (format "Act on %s '%s'%s"
                     (plist-get (car targets) :type)
                     (embark--truncate-target (plist-get (car targets) :target))
                     (if (cdr targets) "…" "")))
           (if prefix
               (pcase (lookup-key keymap prefix 'accept-default)
                 ((and (pred keymapp) km) km)
                 (_ (key-binding prefix 'accept-default)))
             keymap)
           nil nil t (lambda (binding)
                       (not (string-suffix-p "-argument" (cdr binding))))))))

    (setq embark-indicators
      '(embark-which-key-indicator
        embark-highlight-indicator
        embark-isearch-highlight-indicator))

    (defun embark-hide-which-key-indicator (fn &rest args)
      "Hide the which-key indicator immediately when using the completing-read prompter."
      (which-key--hide-popup-ignore-command)
      (let ((embark-indicators
             (remq #'embark-which-key-indicator embark-indicators)))
          (apply fn args)))

    (advice-add #'embark-completing-read-prompter
                :around #'embark-hide-which-key-indicator)
    )

  (use-package consult
    :general
    (leader
     "fr"  'consult-recent-file
     ;; "bm"  'consult-buffer
     "fL"  'consult-locate))

  (use-package embark-consult
    :after (embark consult)
    :hook (embark-collect-mode . consult-preview-at-point-mode))

  (use-package corfu
    :ensure t
    :custom
    (corfu-cycle t) ;; allows cycling through candidates
    (corfu-auto t) ;; disables auto-completion
    (corfu-quit-at-boundary nil) ;; needed to use orderless completion with corfu
    :init
    (global-corfu-mode)
    :config
    (general-def :keymaps 'corfu-map
      "C-n" 'corfu-next
      "C-p" 'corfu-previous))

  (provide 'my-completion)
#+end_src

* the org-mode configurations (=my-org.el=)

